Terraform Plan:

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.dummy will be created
  + resource "local_file" "dummy" {
      + content              = "dummy"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "dummy.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/runner/work/terraform-http-backend/terraform-http-backend/tests/01-simple/.actions-output/tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/terraform-http-backend/terraform-http-backend/tests/01-simple/.actions-output/tfplan"
```

Terraform Plan has been securely encrypted and uploaded to [Github Artifacts](steps.save-plan.outputs.artifact-url)

